{"meta":{"title":"lamzero's home","subtitle":"一个使用linux(raspberry、arch、dibian)的医生。","description":"一个使用linux(raspberry、arch、dibian)的医生。#站描述","author":"lamzero","url":"lamzero.github.io"},"pages":[{"title":"about","date":"2017-06-22T13:45:59.000Z","updated":"2017-06-22T13:45:59.311Z","comments":true,"path":"about/index.html","permalink":"lamzero.github.io/about/index.html","excerpt":"","text":""}],"posts":[{"title":"MRI平扫正常及常见病例的描述模板","slug":"MRI模板","date":"2017-08-23T11:11:45.000Z","updated":"2017-08-23T13:43:47.571Z","comments":true,"path":"2017/08/23/MRI模板/","link":"","permalink":"lamzero.github.io/2017/08/23/MRI模板/","excerpt":"","text":"颅脑（正常颅脑）双侧大脑半球对称，灰白质界限清晰。脑实质内未见明显异常信号影，脑沟、脑裂、脑池及脑室大小形态正常，中线结构未见明显移位。小脑及脑干结构未见明确异常。DWI未见明显异常信号影。增强扫描未见明显异常强化影。（蝶鞍空虚。）头MRA示双侧颈内动脉、大脑前动脉、大脑中动脉及大脑后动脉主干走行正常，无明显局灶性增粗、变细或闭塞。 （正常垂体）垂体显示尚可，其内信号均匀，垂体柄居中未见移位，蝶鞍未见下陷，余未见明显异常。增强扫描未见明显异常强化影。 （正常三叉神经）双侧三叉神经走形正常连续，未见明显异常信号。双侧三叉神经走行区未见占位。右侧三叉神经邻近细小血管伴行。 （腔梗、脑萎缩、脑白质变性）双侧大脑半球对称，双侧基底节区、辐射冠区及额叶可见多发斑片状及点状长T1长T2信号，FLAIR序列呈高信号。（双侧侧脑室枕角旁白质区可见少许斑片状稍长T1长T2信号，边界欠清。）脑沟、脑裂、脑池及脑室扩大，中线结构未见明显移位。DWI未见明显异常高信号影。 （急性梗死）可见大片状长T1长T2异常信号影，边界欠清，局部脑组织肿胀，–侧脑室受压变形，中线结构未见明显移位。DWI上述病灶呈明显均匀高信号。 （出血性梗死）可见大片状不均匀长T1长T2异常信号影，其内夹杂少许短T1信号影，局部脑组织肿胀，侧脑室受压变形，中线结构未见明显移位。DWI上述病灶呈不均匀高信号。 （脑软化灶）可见大片状长T1长T2异常信号影，边界清晰，病灶大小约 cm× cm× cm，FLAIR序列呈高信号，侧脑室扩大，中线结构未见明显移位。DWI上述病灶呈均匀低信号。 （脑挫裂伤）可见片状不均匀长T1长T2异常信号影，其内夹杂点状及斑片状短T1短T2异常信号影，边界不清，DWI呈混杂信号，局部脑组织肿胀，可见少量水肿带环绕，中线结构未见明显移位。 （急性脑出血）可见片状不均匀短T1短T2异常信号影，病灶大小约cm×cm×cm，其周围可见长T1长T2水肿带环绕，–侧侧脑室受压变形，中线结构向–移位。DWI上述病灶呈混杂不均匀高信号。 （硬膜外血肿）可见一梭形等T1长T2异常信号影，病灶与脑组织分界清楚，其间可见硬膜相隔，局部脑组织受压，侧脑室受压略变小，中线结构未见明显移位。脑实质内未见明显异常。DWI上述病灶呈低信号。 （硬膜下出血）可见”新月形”短T1长T2信号影，局部脑回受压、聚拢。脑实质内未见明显异常信号影，中线结构未见明显移位。DWI上述病灶呈混杂不均匀低信号。 （蛛网膜下出血）可见侧裂池”铸型”样短T1长T2异常信号影，中线结构未见明显移位。脑实质内未见明显异常信号影。DWI未见明显异常信号影。 （慢性硬膜下血肿、梗死）双侧硬膜下见弧形异常信号，T1W为等信号，T2W为高信号，脑皮层受压，脑室无扩大，双侧辐射冠区见斑点状长T1长T2信号，中线移位部明显。（颌部见金属伪影干扰） （血管闭塞或细或烟雾病）1、头MRA示右侧大脑前动脉起始段（A1段）未见显影，双侧颈内动脉、大脑中动脉及大脑后动脉主干走行正常，无明显局灶性增粗或变细，管壁光滑，内信号尚均。2、双侧颈内动脉形态可，双侧大脑前、中动脉主干无狭窄扩张，右侧椎动脉细，显示不完整。左侧椎动脉形态可。3、双侧颈内动脉虹吸部及大脑前、中动脉近段闭塞，双侧大脑前、中动脉中远段由迂曲紊乱的侧支血管供血，willi’s环及基底节区可见多发烟雾状血管网，基底动脉及大脑后动脉显示良好。 （动脉血管畸形AVM）可见一团块状异常信号影，T1WI及T2WI均呈混杂信号，其内可见条状或蚯蚓状流空信号改变，T1WI及T2WI均为低信号，病灶位置较表浅，占位征象不明显，脑沟、脑裂、脑池及脑室大小形态正常，中线结构未见明显移位。静脉注入造影剂后见病灶内迂曲的强化血管影，MRA示该部位异常血管团，可见粗大的供血动脉及引流静脉。 （动脉瘤）MRA示左/右颈内动脉虹吸段/大脑中/前/后/交通动脉局限性梭形扩张。直径约为 X cm，病灶边界清楚。 （胶质瘤）可见一类圆形不均匀长T1长T2异常信号影，静脉注入造影剂后病灶未见明显强化，病灶大小约cm×cm×cm，病灶境界较清楚，边缘规则，周围可见少量水肿带，–侧侧脑室受压，中线结构向–移位。 （脑膜瘤）可见一类圆形等T1稍长T2异常信号影，增强扫描病灶显著均匀强化，且可见”脑膜尾征”，病灶境界清楚，以宽基底与硬膜相连，周围可见大片状水肿带，–侧侧脑室受压变形，中线结构向–移位，病灶大小约cm×cm×cm。 （垂体大腺瘤）蝶鞍扩大，鞍底下陷，鞍内可见椭圆形（不规则形）稍长T1稍长T2异常信号影，病灶大小约cm×cm×cm，其内可见类圆形短T1长T2信号影，增强扫描病灶呈中等程度强化。病灶由鞍内向鞍上生长，垂体柄消失，视交叉受压、上抬。双侧海绵窦血管受压，显示欠清。 （垂体微腺瘤）垂体形态饱满，大小约cm×cm×cm，其内可见一小圆形长T1稍长T2异常信号影，增强扫描垂体明显强化，其–侧可见一小圆形无强化区，直径约为cm。垂体柄居中，鞍底未见下陷。视交叉结构对称，未见明确异常信号影。 （颅咽管瘤）鞍上可见一不规则形长T1长T2异常信号影，病灶大小约cm×cm×cm，其内信号欠均匀，部分为实性，部分为囊性，静脉注入造影剂后病灶实性部分不均匀强化，囊性部分囊壁呈中等程度强化，病灶边缘呈分叶状改变，视交叉、第三脑室前下方及额叶后下部受压，幕上脑室扩大。 （室管膜瘤）第四脑室内可见类圆形不均匀长T1长T2异常信号影，DWI呈等信号，增强扫描病灶呈轻中度不均匀强化，病灶境界较清楚，大小约为cm×cm×cm，与第四脑室底紧密相连，第四脑室被撑大，幕上脑室扩张积水。余脑实质内未见明显异常信号影，中线结构未见明显移位。 （髓母细胞瘤）小脑蚓部可见一类圆形长T1长T2异常信号影，大小约为cm×cm×cm，病灶突入第四脑室，边界清楚，病灶周围可见少量片状长T1长T2信号。静脉注入造影剂后病灶明显强化。第四脑室向前移位，幕上脑室明显扩张积水。 （听神经瘤）侧桥小脑角区可见一类圆形长T1长T2异常信号影，静脉注入造影剂后病灶不均匀强化，边缘清晰，略呈分叶状改变，病灶延伸入–侧内听道，后者扩张，直径约cm。病灶大小约cm×cm×cm。 （转移瘤）右侧额叶、左侧颞叶及双侧枕顶叶可见多个大小不等长T1长T2信号类圆形病灶，边界较清楚，病灶周围可见片状水肿带。双侧侧脑室受压，中线结构略右偏。 （蛛网膜囊肿）可见不规则长T1长T2异常信号影，境界清楚，大小约cm×cm×cm，局部脑组织受压改变。脑实质内未见明显异常信号影，脑室大小形态正常，中线结构未见明显移位。DWI上前述病灶为低信号。 左颞极见弧形长T1长T2信号，大小约cm×cm，脑质内未见异常信号，脑室无扩大，中线居中。 （脑脓肿） 可见一环形等T1长T2异常信号影，其内为长T1长T2异常信号影，DWI呈高信号，环壁较厚，且厚薄及均匀，静脉注入造影剂后环壁显著强化，病灶大小约cm×cm×cm，周围可见大片水肿带，–侧侧脑室受压变形，中线结构向–移位。 （病毒性脑炎）于左/右侧颞/顶/额叶可见斑片状异常信号，T1WI呈低信号，T2WI呈高信号，水抑制序列为高信号，中线结构居中，各脑室、脑池大小形态尚正常。 （结核性脑炎并脑积水）幕上脑室对称性扩大，静脉注入造影剂后基底池及环池明显强化，脑实质内未见明显异常信号影，中线结构未见明显移位。 （多发性硬化）双侧额顶叶白质区可见多发大小不等的类圆形稍长T1稍长T2异常信号影，边界不清。部分病灶沿侧脑室旁垂直分布，DWI未见明显异常信号影，静脉注入造影剂后病灶未见明显强化，脑沟、脑裂、脑池及脑室大小形态正常，中线结构未见明显移位。 （灰质异位症）右侧侧脑室体部旁可见一类圆形等T1等T2异常信号影，与邻近灰质信号相似。静脉注入造影剂后未见明显强化，病灶周围未见明确水肿，局部脑室受压变形，病灶大小约cm×cm×cm。余脑实质内未见明显异常信号影，中线结构未见明显移位。 （肾上腺脑白质营养不良）双侧侧脑室后角周围可见对称性大片状不均匀长T1长T2异常信号影，边界不清。DWI呈高信号，静脉注入造影剂后病灶中央部未见明显强化，邻近病灶边缘处可见”花边样”强化，基底节区及额叶白质区未见明显异常信号影，脑沟、脑裂、脑池及脑室大小形态正常，中线结构未见明显移位。 （胼胝体发育不良）胼胝体膝部及体部前部较细小，压部缺如，于胼胝体压部位置可见大片长T1长T2异常信号影，双侧侧脑室枕角距离增大，余颅内未见明显异常。 五官副鼻窦各组窦腔结构清晰，未见明显异常密度影，邻近骨质无破坏，鼻咽部结构可，鼻中隔偏曲，双下鼻甲肥厚。 双侧乳突气化良好，乳突蜂房透过度正常，骨质无破坏。双侧中耳听小骨显示良好,鼓膜显示不清，内听道左右对称，未见扩张及骨质破坏影像。 （鼻窦炎）双侧上颌窦、双侧筛窦、蝶窦及额窦（粘膜增厚、见软组织密度影），邻近骨质无破坏。鼻咽部结构可。鼻中隔偏曲，双下鼻甲肥厚。（左侧鼻咽部软组织肿胀，咽隐窝变浅。） （中耳乳突炎）双侧乳突气化不良，硬化性密度增高，乳突蜂房透过度减低，内可见等密度软组织影。双侧中耳可见软组织密度影，骨质无破坏。对侧乳突气化良好，乳突蜂房透过度正常，骨质无破坏。双侧中耳听小骨显示良好，鼓膜显示不清，内听道左右对称，未见扩张及骨质破坏影像。 咽喉喉咽部结构形态可，未见明显异常密度灶，周围脂肪间隙存在，咽腔通畅。颈部软组织未见明显肿大淋巴结影。双侧甲状腺形态可，边缘光整。 咽喉部结构形态可，双侧对称，未见明确占位性病变，周围脂肪间隙清晰，气管上段形态可，余未见明显异常。 颈部喉咽部结构形态可，未见明显异常密度灶，周围脂肪间隙存在，咽腔通畅。颈部软组织未见明显肿大淋巴结影。双侧甲状腺形态可，边缘光整。 口咽及喉咽部软组织略增厚，密度均匀，咽腔无明显狭窄。颈部软组织结构清晰，脂肪间隙清。颈部淋巴结未见明显增大。双下鼻甲肥厚。 （肿物）甲状腺右叶及峡部内见团片状低密度影，形态不规则，内密度不均匀，周围脂肪间隙模糊，气管受压，余未见明显异常。 肺及纵隔双肺肺纹理增多，双肺未见明显异常密度影，气管及各级支气管通畅。纵隔未见肿大淋巴结影。 （支气管肺炎）双肺纹理增多、增粗、模糊，双中下肺见斑片状模糊影，气管及各级支气管通畅。纵隔未见肿大淋巴结影。 肝脏肝脏形态（可）（大小正常，包膜光整），肝实质内未见明显异常密度灶，肝内外胆管未见明显扩张，胆囊区未见明显阳性（含钙）结石影，脾脏、胰腺未见明显异常密度影。腹膜后未见肿大淋巴结。 （肝囊肿）肝脏大小可，肝内多发散在圆形低密度灶，边界清，较大者位于肝右叶，直径约9.6cm。胆囊不大，壁不厚，内未见明显阳性结石，肝内外胆管未见明显扩张。脾脏及胰腺未见明显异常。腹膜后未见明显肿大淋巴结影。 （肝内胆管结石）肝右叶见点状致密影，余肝质未见异常密度灶，肝内外胆管无扩张，胆囊内未见含钙结石影。脾脏形态及密度均未见异常。腹膜后未见肿大淋巴结。 （原发性肝癌）平扫：肝 叶 段可见一不规则低密度灶，边缘模糊，大小约为 × mm，内部密度不均均，病灶中心可见液性坏死区。增强扫描动脉期，病变明显强化，强化不均匀；至门脉及实质期，病变强化程度低于肝实质，中心坏死区始终未见明显强化。余肝实质形态密度未见异常。门脉显示清楚，走行正常。肝内外胆管未见明显扩张，脾增大/不大。腹膜后未见明显肿大淋巴结影。 （脂肪肝）肝边缘不光整，呈结节状突起，各叶比例失调，肝实质密度减低，肝内外胆管无扩张。胆囊壁增厚，内未见阳性结石影。脾脏增大。胰腺未见明显异常密度灶。扫及左肾见点状致密影。 胰腺胰腺形态可，实质密度均匀，主胰管无扩张，周围脂肪间隙存在，余未见明显异常。 （胰腺炎）胰腺增粗，胰管稍显扩张，胰周可见渗出，左侧肾前筋膜增厚。余未见异常。 肾、肾上腺、阑尾双肾形态大小可，肾实质未见异常密度灶，双侧输尿管走形可，未见明显扩张，膀胱充盈良好，其内未见异常密度灶。 双侧肾上腺大小、形态及密度未见异常，双侧肾上腺最厚处均未超过同侧膈肌角。 （阑尾炎）阑尾增粗、壁增厚，内见小片状高密度影，周围脂肪间隙存在。 髋关节双髋关节构成诸骨形态完整，骨质连续光整，未见明显骨性异常，关节间隙可。 双侧髋关节位置正常，双侧股骨头显示清晰，股骨头内部信号均匀，未见异常信号，关节面光滑连续，关节间隙无狭窄及积液，髋臼骨质无破坏。 双侧骶髂关节形态，骨质密度未见异常，关节间隙呈细线状，清晰规整。周围软组织双侧对称，未见明显肿胀。肌肉间隙清晰。 椎体腰椎序列及曲度正常，所扫L3/4–L5/S1椎间盘形态良好，未见突出及硬膜囊受压，椎小关节未见异常。 胸椎序列可，各椎体形态正常，边缘光整，骨质密度均匀，椎间隙存在，余未见明显异常。 颈椎序列及曲度正常，所扫C2-7椎间盘未见突出及硬膜囊受压。 （压缩性骨折） 胸7椎体变扁呈前窄后宽的楔形改变，内见不规则线状低密度影，骨质连续性中断，部分椎体边缘见轻度骨质增生改变。 （椎间盘轻度突出）曲度及序列尚可，椎间盘向后轻度突出约2-3mm，相应硬膜囊轻度受压，椎小关节未见明显异常。部分椎体骨质增生。 （强直性脊柱炎）双侧髂骨及骶骨近关节面处骨质增生，关节面毛糙，关节面下见多发囊状骨质破坏区，关节间隙稍增宽，周围软组织未见明显异常。","categories":[],"tags":[{"name":"模板,MRI,报告,描述,常见病例,正常病例","slug":"模板-MRI-报告-描述-常见病例-正常病例","permalink":"lamzero.github.io/tags/模板-MRI-报告-描述-常见病例-正常病例/"}],"keywords":[]},{"title":"CT平扫正常及常见病例的描述模板","slug":"CT模板","date":"2017-06-29T11:45:29.000Z","updated":"2017-12-31T10:38:17.982Z","comments":true,"path":"2017/06/29/CT模板/","link":"","permalink":"lamzero.github.io/2017/06/29/CT模板/","excerpt":"","text":"颅脑双侧脑实质未见异常密度影，脑沟、脑裂及脑室系统未见明显异常，中线结构居中。（骨窗未见明显骨折影） （腔梗、脑萎缩）双侧基底节区、放射冠区可见斑点状低密度灶，边界清楚。脑室、脑池扩大，脑沟脑裂增宽加深，中线结构居中。（脑白质变性：脑室旁白质密度减低。） （胶质瘤）左额叶见厚壁环形高密度影，直径约3.0cm，其内侧见一薄壁环，直径约1.4cm,病灶周围见大片低密度水肿带，左侧侧脑室受压变窄，中线结构向右侧移位，右枕叶另见小斑片状混杂密度影。 （硬膜外血肿）左侧颞部可见半月形高密度影，边界稍模糊，周围无明显占位效应，余脑实质内未见异常密度灶。脑室及脑沟脑裂系统正常，中线结构居中。骨窗见 左侧颞骨骨质断裂，断端未见明显移位，邻近软组织肿胀。密度增高。 （脑出血） 区可见大面积高密度影，CT值80Hu左右，周边为低密度水肿带， 侧脑室受压，余小脑及脑干发育正常，内部密度均匀，未见异常密度影。 脑池脑沟正常，中线结构居中/偏向。 （面部骨折） 双上颌窦、筛窦粘膜稍增厚，蝶窦内可见不规则片状高低混杂密度影，骨窗示右侧颧弓、右眼眶内侧壁、右眶骨及右视神经管骨质中断，右侧筛窦向内侧塌陷，余无特殊。 （硬膜下出血）右枕额交界处可见颅内脑外梭形高密度出血灶，枕叶脑实质受推移。另右顶叶脑沟裂内亦可见高密度影充填。小脑及脑干内未见形态及密度异常, 脑中线居中。骨窗未见确切骨折。 （硬膜下出血+蛛网膜下出血）双侧额顶叶脑内可见片状高密度影，CT值70Hu左右，周边为低密度水肿带，侧脑室扩大，双侧额顶部硬膜下腔增宽，脑池脑沟增宽，中线结构无明显移位。 （蛛网膜囊肿）枕部可见一囊性低密度区，边缘光滑锐利，有轻度占位效应。余脑实质内未见异常密度影，脑室脑沟正常，中线结构居中。 五官副鼻窦各组窦腔结构清晰，未见明显异常密度影，邻近骨质无破坏，鼻咽部结构可，鼻中隔偏曲，双下鼻甲肥厚。 双侧乳突气化良好，乳突蜂房透过度正常，骨质无破坏。双侧中耳听小骨显示良好,鼓膜显示不清，内听道左右对称，未见扩张及骨质破坏影像。 （鼻窦炎）双侧上颌窦、双侧筛窦、蝶窦及额窦（粘膜增厚、见软组织密度影），邻近骨质无破坏。鼻咽部结构可。鼻中隔偏曲，双下鼻甲肥厚。（左侧鼻咽部软组织肿胀，咽隐窝变浅。） （中耳乳突炎）双侧乳突气化不良，硬化性密度增高，乳突蜂房透过度减低，内可见等密度软组织影。双侧中耳可见软组织密度影，骨质无破坏。对侧乳突气化良好，乳突蜂房透过度正常，骨质无破坏。双侧中耳听小骨显示良好，鼓膜显示不清，内听道左右对称，未见扩张及骨质破坏影像。 咽喉喉咽部结构形态可，未见明显异常密度灶，周围脂肪间隙存在，咽腔通畅。颈部软组织未见明显肿大淋巴结影。双侧甲状腺形态可，边缘光整。 咽喉部结构形态可，双侧对称，未见明确占位性病变，周围脂肪间隙清晰，气管上段形态可，余未见明显异常。 颈部喉咽部结构形态可，未见明显异常密度灶，周围脂肪间隙存在，咽腔通畅。颈部软组织未见明显肿大淋巴结影。双侧甲状腺形态可，边缘光整。 口咽及喉咽部软组织略增厚，密度均匀，咽腔无明显狭窄。颈部软组织结构清晰，脂肪间隙清。颈部淋巴结未见明显增大。双下鼻甲肥厚。 （肿物）甲状腺右叶及峡部内见团片状低密度影，形态不规则，内密度不均匀，周围脂肪间隙模糊，气管受压，余未见明显异常。 肺及纵隔双肺肺纹理增多，双肺未见明显异常密度影，气管及各级支气管通畅。纵隔未见肿大淋巴结影。 （支气管肺炎）双肺纹理增多、增粗、模糊，双中下肺见斑片状模糊影，气管及各级支气管通畅。纵隔未见肿大淋巴结影。 肝脏肝脏形态（可）（大小正常，包膜光整），肝实质内未见明显异常密度灶，肝内外胆管未见明显扩张，胆囊区未见明显阳性（含钙）结石影，脾脏、胰腺未见明显异常密度影。腹膜后未见肿大淋巴结。 （肝囊肿）肝脏大小可，肝内多发散在圆形低密度灶，边界清，较大者位于肝右叶，直径约9.6cm。胆囊不大，壁不厚，内未见明显阳性结石，肝内外胆管未见明显扩张。脾脏及胰腺未见明显异常。腹膜后未见明显肿大淋巴结影。 （肝内胆管结石）肝右叶见点状致密影，余肝质未见异常密度灶，肝内外胆管无扩张，胆囊内未见含钙结石影。脾脏形态及密度均未见异常。腹膜后未见肿大淋巴结。 （原发性肝癌）平扫：肝 叶 段可见一不规则低密度灶，边缘模糊，大小约为 × mm，内部密度不均均，病灶中心可见液性坏死区。增强扫描动脉期，病变明显强化，强化不均匀；至门脉及实质期，病变强化程度低于肝实质，中心坏死区始终未见明显强化。余肝实质形态密度未见异常。门脉显示清楚，走行正常。肝内外胆管未见明显扩张，脾增大/不大。腹膜后未见明显肿大淋巴结影。 （脂肪肝）肝边缘不光整，呈结节状突起，各叶比例失调，肝实质密度减低，肝内外胆管无扩张。胆囊壁增厚，内未见阳性结石影。脾脏增大。胰腺未见明显异常密度灶。扫及左肾见点状致密影。 胰腺胰腺形态可，实质密度均匀，主胰管无扩张，周围脂肪间隙存在，余未见明显异常。 （胰腺炎）胰腺增粗，胰管稍显扩张，胰周可见渗出，左侧肾前筋膜增厚。余未见异常。 肾、肾上腺、阑尾双肾形态大小可，肾实质未见异常密度灶，双侧输尿管走形可，未见明显扩张，膀胱充盈良好，其内未见异常密度灶。 双侧肾上腺大小、形态及密度未见异常，双侧肾上腺最厚处均未超过同侧膈肌角。 （阑尾炎）阑尾增粗、壁增厚，内见小片状高密度影，周围脂肪间隙存在。 （阑尾炎&gt;腹水） 腹盆腔见大量游离密度影，肠系膜脂肪间隙不清，大网膜密度不均。阑尾显示不清。 髋关节双髋关节构成诸骨形态完整，骨质连续光整，未见明显骨性异常，关节间隙可。 双侧髋关节位置正常，双侧股骨头显示清晰，股骨头内部信号均匀，未见异常信号，关节面光滑连续，关节间隙无狭窄及积液，髋臼骨质无破坏。 双侧骶髂关节形态，骨质密度未见异常，关节间隙呈细线状，清晰规整。周围软组织双侧对称，未见明显肿胀。肌肉间隙清晰。 椎体腰椎序列及曲度正常，所扫L3/4–L5/S1椎间盘形态良好，未见突出及硬膜囊受压，椎小关节未见异常。 胸椎序列可，各椎体形态正常，边缘光整，骨质密度均匀，椎间隙存在，余未见明显异常。 颈椎序列及曲度正常，所扫C2-7椎间盘未见突出及硬膜囊受压。 （压缩性骨折） 胸7椎体变扁呈前窄后宽的楔形改变，内见不规则线状低密度影，骨质连续性中断，部分椎体边缘见轻度骨质增生改变。 （椎间盘轻度突出）曲度及序列尚可，椎间盘向后轻度突出约2-3mm，相应硬膜囊轻度受压，椎小关节未见明显异常。部分椎体骨质增生。 （强直性脊柱炎）双侧髂骨及骶骨近关节面处骨质增生，关节面毛糙，关节面下见多发囊状骨质破坏区，关节间隙稍增宽，周围软组织未见明显异常。","categories":[],"tags":[{"name":"模板,CT,报告，描述,常见病例,正常病例","slug":"模板-CT-报告，描述-常见病例-正常病例","permalink":"lamzero.github.io/tags/模板-CT-报告，描述-常见病例-正常病例/"}],"keywords":[]},{"title":"呼吸系统","slug":"呼吸系统","date":"2017-06-23T03:16:33.000Z","updated":"2018-05-16T08:31:37.981Z","comments":true,"path":"2017/06/23/呼吸系统/","link":"","permalink":"lamzero.github.io/2017/06/23/呼吸系统/","excerpt":"","text":"一、支气管扩张症【病因】（一）后天性1、慢性感染引起支气管壁组织的破坏。2、支气管内分泌物淤积与长期剧烈咳嗽，引起支气管内压增高。3、肺不张及肺纤维化对支气管壁产生的外在性牵拉。（二）先天性管壁平滑肌、腺体和软骨组织减少或缺如，同时有支气管上皮脱落，支气管壁内炎性细胞浸润，管壁肿胀和周围纤维组织增生 【分型】根据形态分为1、柱状型支气管扩张（支气管远端宽度与近端相近）2、囊状型支气管扩张（支气管远端宽度大于近端，远端呈球囊状）3、静脉曲张型支气管扩张（扩张程度稍大于柱状，管壁有局限性收缩致支气管形态不规则，形似静脉曲张） 【好发部位】双肺下叶、左肺舌叶 【临床表现】咳嗽、咳痰、咯血。合并感染时发热、胸痛，如病变广泛有呼吸困难、发绀、杵状指等。 【影像学表现】 X线表现早期X线无异常发现较严重者肺纹理增多、增粗、紊乱扩张含气的支气管表现为粗细不均的管状透明影。扩张含分泌物的支气管表现为不规则的杵状致密影。囊状支气管扩张呈囊状或蜂窝状影，有时囊底有小液平，多伴肺实质炎症。支扩继发感染时，表现为斑片状模糊影。 支气管扩张支气管扩张 CT表现 1、柱状型支气管扩张 “轨道征”–支气管水平走行与CT层面平行时表现 轨道征 “印戒征” - 支气管与CT层面呈垂直走行表现为厚壁的圆形透亮影，与伴行的肺动脉共同表现 印戒征：支气管和肺动脉走行一致，当支气管扩张，直径大于伴行肺动脉时，两者合在一起是就像戒指一般：扩张的支气管是戒指的环，而肺动脉就是环上的钻石。 指状征 - 扩张的支气管内为粘液所充盈时，表现为与血管伴行而粗于血管的柱状或结节状高密度影。 支气管扩张，粘液栓形成。 2、囊状型支气管扩张支气管远端呈囊状膨大，成簇的囊状扩张可形成葡萄串状阴影，合并感染时囊内可出现液平及囊壁增厚。 囊状型支气管扩张 囊状型支气管扩张可见液平 3、曲张型支气管扩张支气管壁呈粗细不均的囊柱状改变，壁不规则，可呈念珠状 曲张型支气管扩张 二、肺炎（一）大叶性肺炎【病源学】95%由G+肺炎双球菌，极少数链球菌所致 【临床表现】多见于青壮年，发病前多有受凉、过度劳累或上呼吸道感染史。起病急，突然高热、恶寒、胸痛、咳铁锈色痰，白细胞及中性粒细胞明显增高。 【病理分期】1、 充血期（12-24H）2、 红色肝样变期（2-3D）3、 灰色肝样变期（2-3D）4、 消散期（1W）细菌生长繁殖→肺泡毛细血管充血扩张，浆液渗出→大量浆液及红细胞、纤维蛋白原渗入到肺泡，替代气体→白细胞趋向聚集并渗入到肺泡内，吞噬细菌及肺泡内渗出物→渗出物及细菌被溶解、吸收或咳出，肺泡渐充气恢复正常病变以渗出为主，为纤维素性炎，不破坏肺组织，痊愈后不遗留瘢痕 【影像学表现】X线表现1、充血期表现为不同形状及范围的渗出及实变，可无阳性改变。 2、实变期大片状密度均匀的致密阴影。炎症累及肺段表现为片状或三角形致密影；累及整个肺叶，呈以肺间裂为界的大片致密阴影，有时可见“空气支气管征” 大叶性肺炎实变期 炎症累及肺段表现为片状或三角形致密影 3、消散期实变区密度逐渐减低，由于消散不均匀，表现为散在的、大小不一和分布不规则的斑片状、进一步吸收后病变区出现条索状影，少数病例因长期不吸收演变为机化性肺炎。 大叶性肺炎消散期 大叶性肺炎消散期 CT表现1、充血期病变区磨玻璃样阴影，边缘模糊 弥漫性磨玻璃样密度增高影（不一定是大叶性肺炎） 2、实变期可见呈大叶或肺段分布的致密阴影，可见空气支气管征，病变边缘被胸膜所局限且平直， 大叶性肺炎实变期：右下肺可见片状密度增高影，边缘模糊，内密度不均匀，其内可见空气支气管征。 3、消散期随病变的吸收，实变影密度减低，呈散在、大小不一的斑片状影，进一步吸收后病变区出现条索状影或病灶完全消失。 大叶性肺炎消散期：左侧可见片状实变影，右侧实变影密度减低 （二）支气管肺炎又称小叶性肺炎，多见于婴幼儿、青少年和老年及极度衰弱的患者，或手术后及长期卧床者。 【病理】病变以小叶支气管为中心，经过终末细支气管延及肺泡，在支气管和肺泡内产生炎性渗出物。病变范围为小叶性，呈散在性两侧分布，也可融合成片，易导致小叶型肺气肿或肺不张。 【临床表现】临床表现较重，多有高热、咳嗽、咳泡沫样粘痰或浓痰，并伴有呼吸困难、发绀及胸痛等。 【影像学表现】X线表现两肺中下野的内、中带，肺纹理增多、增粗、模糊；沿肺纹理分布斑片或斑点状模糊致密影，密度不均，可融合成较大的片状；有时可见空洞、肺气囊、三角形肺不张。 支气管肺炎-X线 CT表现肺纹理增粗、模糊，病灶呈弥散散在斑片影，典型者呈腺泡样形态，边缘模糊；也可呈分散的小片状实变影，或融合成大片状，周围常伴阻塞性肺气肿或肺不张。 支气管肺炎-CT （三）间质性肺炎【病理】小支气管壁及肺间质炎症细胞浸润，淋巴管、淋巴结炎症，肺泡很少累及。 【临床表现】除原发的急性传染病症状外，常同时出现气急、发绀、咳嗽、鼻翼扇动。 【影像学表现】X线表现病变累及支气管、血管周围间质时，可见纤细条纹状密度影，，走形僵直。病变累及终末支气管时，表现为短条状，相互交织成网状的密度增高影。 CT表现弥漫分布的网状影，可有胸膜增厚、结片影、肺气肿、肺不张；急性早期或轻症时可有磨玻璃样密度影。 间质性肺炎- 双肺近胸膜下见网格状密度增高影，小叶间隔增厚，呈磨玻璃样改变。 （四）支原体肺炎【病理】有支原体浸入肺内引起支气管、细支气管粘膜及其周围间质充血、水肿，多核细胞浸润，侵入肺泡可产生肥饱浆液性渗出性炎症。 【临床表现】有疲惫感，或有低热、咳嗽，有时咳少量白色粘液痰。少数重症患者有高热及呼吸困难。实验室检查支原体抗体呈阳性。 【影像学表现】X线表现早期主要是肺间质炎性改变，表现为肺纹理增多及网格影，渗出较多时为斑点（片）状影，较典型表现为自肺门附近相肺野外围伸展的大片扇形影，其外缘逐渐变淡消失。 支原体肺炎 CT表现主要为肺间质炎症，可见病变区肺纹理增粗而模糊。 三、肺脓肿【病理】化脓性肺炎导致细支气管阻塞，小血管炎性栓塞，肺组织坏死液化，坏死物经支气管咳出形成脓腔。破溃到胸腔，则形成脓气胸、支气管胸膜瘘 【临床表现】急性肺脓肿：发病急剧，高热、寒战、咳嗽、胸痛；全身中毒症状；咳大量脓痰（静置后分三层），有腥臭味；白细胞明显增高。由厌氧菌引起的肺脓肿呈亚急性或慢性发展，多数仅低热、咳嗽，白细胞可无明显变化。 【感染途径】1、吸入性：最多见，好发于上叶后段及下叶背段2、血源性：具有多发的特点3、邻近器官感染直接蔓延：肝脓肿 【影像学表现】X线表现表现为大片状致密影，密度较均匀，边缘模糊，如有坏死，液化局部密度稍减低，坏死物排出后有空洞，空洞内见液平。 肺脓肿-单发 肺脓肿多发空洞-空洞常为中心性，可为偏心性，壁虽厚，但内壁常较光整，底部常见液平。 肺脓肿-多房空洞 肺脓肿吸收过程-空洞壁逐渐变薄，腔也慢慢缩小，周围有较多紊乱的条索状纤维病灶 CT表现早期为较大片状高密度影，占据一个或两个肺段相邻部分。肺窗病灶邻近胸膜侧密度较高且均匀，肺门侧密度多较淡且不均匀，叶间胸膜边缘清晰锐利；纵隔窗可见空气支气管征；增强扫描脓肿壁可见明显环形强化。新形成的空洞内壁多不规则，慢性则增厚，内壁清晰，周围有较多紊乱的条索状纤维病灶，以及胸膜增厚，可有支气管扩张、肺气肿、淋巴结肿大。血源性为多发结节或片状密度增高影，边缘模糊。 【诊断与鉴别诊断】1、结核性空洞：多无气液平面，周围常有卫星病灶。2、癌性空洞：壁厚薄不均，空洞内壁呈结节状凹凸不平，空洞外缘可有分叶及毛刺征。 四、肺结核【病理】渗出、增殖和变质。1、结核性肺泡炎：进展性表现，可以吸收消散或纤维条索及钙化而痊愈；也可转化为结核性肉芽肿或恶化为干酪性坏死，演化为结核球，形成空洞并可血行或支气管播散。2、结核性肉芽肿：为渗出已控制的结果，但未痊愈，可因机体健康状况及治疗情况完全吸收、钙化、纤维化痊愈，或重新转化为渗出性病变 【临床表现】可无明显症状，可有低热、盗汗、疲乏、消瘦、食欲不振、咳嗽、咯血、胸痛、气促等急性血行播散者可有高热、寒战、咳嗽、昏睡、神志不清等全身中毒症状。 【分类】中国结核病分类标准 1、原发性肺结核（Ⅰ型） 原发结核感染所致的临床病症，包括原发综合征和胸内淋巴结结核 2、血行播散型肺结核（Ⅱ型） 急性、亚急性、慢性血行播散型肺结核 3、继发性肺结核（Ⅲ型） 浸润性肺结核与慢性纤维空洞性肺结核 4、结核性胸膜炎（Ⅳ型） 结核性干性胸膜炎、结核性渗出性胸膜炎、结核性脓胸 5、其他肺外结核（Ⅴ型） 按部位及脏器命名，如骨关节结核、结核性脑膜炎、肾结核、肠结核等 【影像学表现】1、原发性肺结核（Ⅰ型）又名原发综合征，多见于儿童和青少年，少数为成人X线表现1、原发浸润肺近胸膜处原发病灶，多位于中上肺野，为局限性斑片状阴影，中央较浓密，周边较淡而模糊，当周边炎症吸收后边缘略清晰2、淋巴管炎从原发病灶向肺门走行的条索状阴影，不规则，此阴影仅一过性出现，一般不易见到3、肺门、纵隔淋巴结肿大表现为肺门增大或纵隔边缘肿大淋巴结突向肺野 肺结核-原发综合征 肺门淋巴结结核 CT表现可清晰发现肺门及纵隔淋巴结增大，其形态、大小、边缘轮廓和密度等；显示隆突下淋巴结增大；同时CT可早期发现原发灶内的干酪样坏死，表现为病灶中心相对低密度区 双肺结核（原发性渗出浸润为主型） 右肺中叶病灶伴右肺门淋巴结增大，考虑：原发性肺结核 2、血行播散型肺结核（Ⅱ型）X线表现 ① 急性血行播散型肺结核：两肺弥漫性粟粒状阴影，大小1～2mm，边缘清晰 特点：三均匀（大小均匀、密度均匀、分布均匀）② 亚急性血行播散型肺结核：多见于两肺上、中肺野；表现为粟粒状阴影三不均匀（大小不一、密度不均、分布不均）；病灶可融合，可增殖硬结，可钙化，也可纤维化呈索条阴影，甚至可形成空洞透亮区；同时，常伴两下肺透光度增高的代偿性肺气肿，双隔降低，心影垂直，可见胸膜增厚与粘连③ 慢性血行播散型肺结核：类似亚急性血行播散型肺结核表现，大部分病变呈增殖性改变，病灶边缘基本清晰，纤维索条状阴影更明显、病灶钙化更多见，胸膜增厚或粘连更显著。两肺纹理增粗紊乱更明显 血行散播型肺结核-两肺弥漫性粟粒状阴影。粟粒大小为1mm～2mm，边缘清晰。粟粒影像特点主要为三均匀，即大小均匀、密度均匀和分布均匀 慢性血行散播型肺结核-大部分病变呈增殖性改变，病灶边缘基本清晰，纤维索条状影更明显．或者病灶钙化更多见 CT表现早期急性粟粒型肺结核表现为两肺广泛分布1～2mm大小的点状阴影，密度均匀、边界清楚，分布均匀，与支气管走行无关。亚急性或慢性血行播散型肺结核CT与X线胸片相似，主要表现为多发大小不一的结节影，上肺结节多且大于下肺结节 双肺多发粟粒结节 3、继发性肺结核（Ⅲ型）成年常见，主要有三种主型：渗出侵润、干酪、空洞，多为已静止的原发病灶重新活动（内源性），从外部再次吸入（外源性，不引起干酪病灶，肺门淋巴结不大）。 渗出侵润为主型：大多呈斑片状或云雾状，边缘模糊，病灶内密度减低为病灶溶解或空洞形成，其他肺野可有播散灶。病变常与纤维化并存，可伴邻近支扩、局限肺气肿。 干酪为主型：分为结核球（纤维组织包围干酪性病变、空洞的引流支气管阻塞而被干酪组织所填充，呈圆形或椭圆形，表面光滑密度较高且不甚均匀，部分可见浅分叶，少数可有毛刺征或胸膜凹陷征，干酪性物质液化排出后形成空洞&lt;形态不一，厚壁多见&gt;，可有钙化灶或卫星灶，邻近胸膜时有时可见索条状粘连带。）及干酪性肺炎（大量结核分枝杆菌经支气管入侵肺组织而和迅速引起的干酪样坏死性肺炎，表现为实变，类似于大叶性肺炎。） 空洞为主型：由纤维厚壁空洞、广泛的纤维性变及支气管播散灶组成，查痰可见菌，病灶周围见较多的索条状致密影，可有支扩，病变同侧或对侧多见新旧不一的结节状支气管播散灶，可有钙化。纵隔向患侧移位，常伴明显的胸膜增厚及相应部位的胸廓塌陷，邻近肋间隙变窄，肋膈角变钝，可使肺门上提，肺纹理呈垂柳状。 X线及CT表现 （CT表现与X线表现相似，更清晰显示病变大小、形态、范围、轮廓、密度及其与周围结构间关系）（1）浸润性肺结核 浸润性肺结核 - X线表现：多种多样，可以一种为主或多种征象混合并存 ① 局限性斑片阴影：见于两肺上叶尖段、后段和下叶背段，右侧多于左侧。 局限性斑片影 - 见于两肺上叶尖段、后段和下叶背段，右侧多于左侧 ② 大叶性干酪性肺：一个肺段或肺叶呈大片致密性实变，中心密度较高，边缘模糊 干酪性肺炎 - 一个肺段或肺叶呈大片致密性实变，边缘模糊,内可见大小不等的不规则透明影 ③ 增殖性病变：呈斑点状阴影，边缘较清晰，排列成“梅花瓣”或“树芽”状，为结核病的典型表现 增殖性病变 - 呈斑点状阴影，边缘较清晰，排列成“梅花瓣”或“树芽”状，为结核病的典型表现 ④ 结核球：圆形、椭圆形阴影，大小2-3mm较常见，边缘清晰，轮廓光滑，偶有分叶，密度较高，内部常见斑点、层状或环状钙化。结核球周围常见散在纤维增殖性病灶，称“卫星灶” 结核球 ⑤ 结核性空洞：圆形或椭圆形病灶内见透亮区。空洞壁薄，内壁较规则，有时可呈厚壁不规则空洞。常见一条或数条粗大条状阴影与空洞相连，表示引流支气管与空洞相通 结核性空洞 结核性空洞 ⑥ 支气管播散病变：沿支气管分布的斑片状阴影，呈腺泡排列，或相互融合成小叶阴影。 支气管散播病变 支气管散播病变 ⑦ 硬结钙化：病灶呈边缘锐利的高密度影，完全钙化者，呈骨样密度的斑片状或小块状影。 硬结钙化 ⑧ 小叶间隔增厚表现为索条及网状阴影。 条索影 条索影 （2）慢性纤维空洞性肺结核 - 属于继发性肺结核晚期类型 X线及CT表现 ① 单侧或双侧肺上中部不规则透亮区 ② 空洞壁厚，壁周有大量纤维粘连 ③ 多支引流支气管与空洞相通，呈索条状轨道状阴影 ④ 空洞周围有大片渗出和干酪病变 ⑤ 肺门上抬，肺纹理呈垂柳状 ⑥ 双肺中下叶透亮度增高 ⑦ 纵隔变窄，滴状心 ⑧ 肋间隙增宽，膈低平，桶状胸 ⑨ 胸膜增厚粘连 ⑩ 支气管播散灶 慢性纤维空洞型肺结核 慢性纤维空洞型肺结核 慢性纤维空洞型肺结核 4、结核性胸膜炎（Ⅳ型）儿童及青少年多见，可为肺内结核灶直接蔓延或弥散至胸膜的结核菌体蛋白所引起的过敏反应所致，分为干性胸膜炎（不产渗液或仅有少量渗液渗出的胸膜炎）及渗出性胸膜炎（液体为浆液性，偶为血性，病程长时有大量纤维素沉着，并引起胸膜肥厚、粘连、钙化或包裹性积液） X线及CT表现：游离性胸腔积液、肺底积液（液体聚集于肺底与横膈之间，立位胸片类似于病侧横膈升高，但膈顶最高点在外1/3，卧位胸片可见病侧呈均一性高密度影及正常横膈）、叶间积液（叶间裂走行区密度均匀的梭型密度影）、包裹性积液 【诊断与鉴别诊断】结核球与周围型肺癌结核性空洞与癌性空洞","categories":[],"tags":[{"name":"呼吸系统","slug":"呼吸系统","permalink":"lamzero.github.io/tags/呼吸系统/"},{"name":"常见疾病的影像诊断","slug":"常见疾病的影像诊断","permalink":"lamzero.github.io/tags/常见疾病的影像诊断/"}],"keywords":[]},{"title":"收集几张好看的壁纸(以后慢慢添加)","slug":"收集几张好看的壁纸","date":"2017-06-22T16:09:15.000Z","updated":"2017-06-23T02:59:10.510Z","comments":true,"path":"2017/06/23/收集几张好看的壁纸/","link":"","permalink":"lamzero.github.io/2017/06/23/收集几张好看的壁纸/","excerpt":"","text":"来源于某神社","categories":[],"tags":[{"name":"壁纸","slug":"壁纸","permalink":"lamzero.github.io/tags/壁纸/"},{"name":"动漫","slug":"动漫","permalink":"lamzero.github.io/tags/动漫/"}],"keywords":[]},{"title":"raspberry配置","slug":"raspberry配置","date":"2017-06-22T15:14:32.000Z","updated":"2017-06-22T16:04:53.979Z","comments":true,"path":"2017/06/22/raspberry配置/","link":"","permalink":"lamzero.github.io/2017/06/22/raspberry配置/","excerpt":"","text":"基本软件安装apt install screenfetch nload vnstat htop iotop deluge deluged deluge-web samba minidlna ttf-wqy-zenhei scim-pinyin mplayer tightvncserver 系统升级sudo apt-get updatesudo apt-get upgradesudo apt-get dist-upgrade -y LAMP或LNMP的安装及卸载sudo apt-get install apache2 mysql-server mysql-client php5 php5-gd php5-mysql php5 libapache2-mod-php5 php5-mysql php5-curl php5-gd php5-intl php-pear php5-imagick php5-imap php5-mcrypt php5-memcache php5-ming php5-ps php5-pspell php5-recode php5-snmp php5-sqlite php5-tidy php5-xmlrpc php5-xsl php5-xcache phpmyadmin sudo apt-get remove –purge apache2 apache2-mpm-prefork apache2-utils apache2.2-common libapache2-mod-php5 libapr1 libaprutil1 libdbd-mysql-perl libdbi-perl libmysqlclient15off libnet-daemon-perl libplrpc-perl libpq5 mysql-client-5.0 mysql-common mysql-server mysql-server-5.0 php5-common php5-mysql sudo rm -rf /etc/php5 sudo apt-get autoremove mysql-server sudo apt-get remove mysql-common (非常重要) sudo apt-get install nginx php5-mysql mysql-server mysql-client php5-fpm l php5 php5-cli 移动硬盘的开机挂载apt-get install ntfs-3g mkdir /usb UUID=\"********\" /usb ntfs-3g defaults,permissions,nofail 0 0 UUID=\"********\" /usb ext4 defaults,nofail 0 0 samba及minidlna的配置文件[share] path = /usb/ valid users = lamzero browseable = yes public = yes writable = yes friendly_name=DLNAmedia_dir=A,/usb/Musicmedia_dir=P,/usb/Picturemedia_dir=V,/usb/Videodb_dir=/usb/dblog_dir=/usb/log 好像是没用的yeelink配置#!/bin/bash # /etc/init.d/yeelink.service ### BEGIN INIT INFO # Provides: embbnux # Required-Start: $remote_fs $syslog # Required-Stop: $remote_fs $syslog # Default-Start: 2 3 4 5 # Default-Stop: 0 1 6 # Short-Description: yeelink initscript # Description: This service is used to manage a led ### END INIT INFO RETVAL=0 start(){ echo -n \"mystart serive ...\" cd /home/pi su pi -c \"python /home/pi/yeelink.py\" } stop(){ echo \"mystart service is stoped...\" } case $1 in start) start ;; stop) stop ;; esac exit $RETVAL [Desktop Entry]Name=yeelinkComment=My Python ProgramExec=python /home/pi/yeelink.pyTerminal=falseMultipleArgs=falseType=ApplicationCategories=Application;Development;StartupNotify=true tightvncserver的配置过程及配置文件sudo nano /etc/init.d/tightvncserver #!/bin/sh ### BEGIN INIT INFO # Provides: tightvncserver # Required-Start: $local_fs # Required-Stop: $local_fs # Default-Start: 2 3 4 5 # Default-Stop: 0 1 6 # Short-Description: Start/stop tightvncserver ### END INIT INFO # More details see: # http://www.penguintutor.com/linux/tightvnc ### Customize this entry # Set the USER variable to the name of the user to start tightvncserver under export USER='root' ### End customization required eval cd ~root case \"$1\" in start) # 启动命令行。此处自定义分辨率、控制台号码或其它参数。 su root -c '/usr/bin/tightvncserver -depth 16 -geometry 800x600 :1' echo \"Starting TightVNC server for $USER \" ;; stop) # 终止命令行。此处控制台号码与启动一致。 su root -c '/usr/bin/tightvncserver -kill :1' echo \"Tightvncserver stopped\" ;; *) echo \"Usage: /etc/init.d/tightvncserver {start|stop}\" exit 1 ;; esac exit 0 ``` bash sudo chmod 755 /etc/init.d/tightvncserver sudo update-rc.d tightvncserver defaults # aria2 的配置过程及配置文件 ``` bash #!/bin/sh ### BEGIN INIT INFO # Provides: aria2 # Required-Start: $remote_fs $network # Required-Stop: $remote_fs $network # Default-Start: 2 3 4 5 # Default-Stop: 0 1 6 # Short-Description: Aria2 Downloader ### END INIT INFO USER=pi CONF=/mnt/usb/.aria2/aria2.conf case \"$1\" in start) echo \"Start aria2c\" umask 0002 su - $USER -c \"aria2c --conf-path=$CONF -D\" ;; stop) echo \"Stopping aria2c, please wait...\" killall -w aria2c ;; restart) echo \"Stopping aria2c, please wait...\" killall -w aria2c echo \"Start aria2c\" umask 0002 su - $USER -c \"aria2c --conf-path=$CONF -D\" ;; *) echo \"$0 {start|stop|restart|status}\" ;; esac exit ## '#'开头为注释内容, 选项都有相应的注释说明, 根据需要修改 ## ## 被注释的选项填写的是默认值, 建议在需要修改时再取消注释 ## ## 文件保存相关 ## # 文件的保存路径(可使用绝对路径或相对路径), 默认: 当前启动位置 dir=/mnt/usb/aria2 # 启用磁盘缓存, 0为禁用缓存, 需1.16以上版本, 默认:16M disk-cache=32M # 文件预分配方式, 能有效降低磁盘碎片, 默认:prealloc # 预分配所需时间: none &lt; falloc ? trunc &lt; prealloc # falloc和trunc则需要文件系统和内核支持 # NTFS建议使用falloc, EXT3/4建议trunc, MAC 下需要注释此项 file-allocation=falloc # 断点续传 continue=true ## 下载连接相关 ## # 最大同时下载任务数, 运行时可修改, 默认:5 max-concurrent-downloads=10 # 同一服务器连接数, 添加时可指定, 默认:1 max-connection-per-server=10 # 最小文件分片大小, 添加时可指定, 取值范围1M -1024M, 默认:20M # 假定size=10M, 文件为20MiB 则使用两个来源下载; 文件为15MiB 则使用一个来源下载 min-split-size=10M # 单个任务最大线程数, 添加时可指定, 默认:5 split=5 # 整体下载速度限制, 运行时可修改, 默认:0 #max-overall-download-limit=0 # 单个任务下载速度限制, 默认:0 #max-download-limit=0 # 整体上传速度限制, 运行时可修改, 默认:0 #max-overall-upload-limit=0 # 单个任务上传速度限制, 默认:0 #max-upload-limit=0 # 禁用IPv6, 默认:false disable-ipv6=true ## 进度保存相关 ## # 从会话文件中读取下载任务 input-file=/etc/aria2/aria2.session # 在Aria2退出时保存`错误/未完成`的下载任务到会话文件 save-session=/etc/aria2/aria2.session # 定时保存会话, 0为退出时才保存, 需1.16.1以上版本, 默认:0 #save-session-interval=0 ## RPC相关设置 ## # 启用RPC, 默认:false enable-rpc=true # 允许所有来源, 默认:false rpc-allow-origin-all=true # 允许非外部访问, 默认:false rpc-listen-all=true # 事件轮询方式, 取值:[epoll, kqueue, port, poll, select], 不同系统默认值不同 #event-poll=select # RPC监听端口, 端口被占用时可以修改, 默认:6800 rpc-listen-port=6800 # 设置的RPC授权令牌, v1.18.4新增功能, 取代 --rpc-user 和 --rpc-passwd 选项 #rpc-secret=&lt;TOKEN&gt; # 设置的RPC访问用户名, 此选项新版已废弃, 建议改用 --rpc-secret 选项 #rpc-user=&lt;USER&gt; # 设置的RPC访问密码, 此选项新版已废弃, 建议改用 --rpc-secret 选项 #rpc-passwd=&lt;PASSWD&gt; ## BT/PT下载相关 ## # 当下载的是一个种子(以.torrent结尾)时, 自动开始BT任务, 默认:true follow-torrent=true # BT监听端口, 当端口被屏蔽时使用, 默认:6881-6999 listen-port=51413 # 单个种子最大连接数, 默认:55 bt-max-peers=55 # 打开DHT功能, PT需要禁用, 默认:true enable-dht=true # 打开IPv6 DHT功能, PT需要禁用 #enable-dht6=false # DHT网络监听端口, 默认:6881-6999 #dht-listen-port=6881-6999 # 本地节点查找, PT需要禁用, 默认:false bt-enable-lpd=true # 种子交换, PT需要禁用, 默认:true enable-peer-exchange=true # 每个种子限速, 对少种的PT很有用, 默认:50K #bt-request-peer-speed-limit=50K # 客户端伪装, PT需要 #peer-id-prefix=-TR2770- #user-agent=Transmission/2.77 # 当种子的分享率达到这个数时, 自动停止做种, 0为一直做种, 默认:1.0 seed-ratio=0 # 强制保存会话, 话即使任务已经完成, 默认:false # 较新的版本开启后会在任务完成后依然保留.aria2文件 #force-save=false # BT校验相关, 默认:true #bt-hash-check-seed=true # 继续之前的BT任务时, 无需再次校验, 默认:false bt-seed-unverified=true # 保存磁力链接元数据为种子文件(.torrent文件), 默认:false bt-save-metadata=true","categories":[],"tags":[{"name":"linux","slug":"linux","permalink":"lamzero.github.io/tags/linux/"},{"name":"树莓派","slug":"树莓派","permalink":"lamzero.github.io/tags/树莓派/"},{"name":"raspberry","slug":"raspberry","permalink":"lamzero.github.io/tags/raspberry/"}],"keywords":[]},{"title":"我的VPS初始配置","slug":"lamzero","date":"2017-06-22T12:19:10.000Z","updated":"2017-06-22T15:12:38.742Z","comments":true,"path":"2017/06/22/lamzero/","link":"","permalink":"lamzero.github.io/2017/06/22/lamzero/","excerpt":"","text":"apt-get install zsh python-pip apache2 screenfetch nano deluged deluge-web vnstat nload wget git htop iftopdpkg -l|grep linux-imageapt-get purgeupdate-grubpip install shadowsocks speedtest-cli build-essential autoconf libtool libssl-dev debhelper dh-systemd init-system-helpers pkg-config asciidoc xmlto apg libpcre3-devhttps://github.com/shadowsocksr/shadowsocksr-libev.gitcd shadowsocksr-libev./configuremakemake installcd /root sh -c “$(wget https://raw.githubusercontent.com/robbyrussell/oh-my-zsh/master/tools/install.sh -O -)” wget https://download.libsodium.org/libsodium/releases/LATEST.tar.gztar zxf LATEST.tar.gzcd libsodium*./configuremake &amp;&amp; make installecho /usr/local/lib &gt; /etc/ld.so.conf.d/usr_local_lib.confldconfigcd /root echo 1 &gt; /proc/sys/vm/drop_caches git clone -b manyuser https://github.com/shadowsocksr/shadowsocksr.gitmv ./shadowsocksr/shadowsocks ./rm -rf ./shadowsocksrnano /root/shadowsocks/user-config.json { \"server\":\"0.0.0.0\", \"server_ipv6\":\"::\", \"local_address\":\"127.0.0.1\", \"local_port\":1080, \"port_password\":{ \"53\":{\"protocol\":\"auth_sha1\", \"password\":\"123321\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"138\":{\"protocol\":\"auth_sha1\", \"password\":\"@pass201609\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"137\":{\"protocol\":\"auth_sha1\", \"password\":\"pass201609\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"80\":{\"protocol\":\"auth_sha1\", \"password\":\"123321\", \"obfs\":\"http_simple\", \"obfs_param\":\"\"}, \"8080\":{\"protocol\":\"auth_sha1\", \"password\":\"123321\", \"obfs\":\"http_simple\", \"obfs_param\":\"\"} }, \"timeout\":600, \"method\":\"chacha20\", \"protocol\": \"auth_sha1\", \"protocol_param\": \"\", \"obfs\": \"http_simple\", \"obfs_param\": \"\", \"redirect\": \"\", \"dns_ipv6\": false, \"fast_open\": false, \"workers\": 1 } { \"server\":\"0.0.0.0\", \"local_address\":\"127.0.0.1\", \"local_port\":1080, \"port_password\":{ \"53\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"138\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"137\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"80\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"http_simple\", \"obfs_param\":\"\"}, \"8080\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"http_simple\", \"obfs_param\":\"\"}, \"1231\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"tls1.2_ticket_auth\", \"obfs_param\":\"\"}, \"1230\":{\"protocol\":\"auth_aes128_sha1\", \"password\":\"pass2017\", \"obfs\":\"http_simple\", \"obfs_param\":\"\"} }, \"timeout\":600, \"method\":\"chacha20\", \"protocol\": \"auth_aes128_sha1\", \"protocol_param\": \"\", \"obfs\": \"http_simple\", \"obfs_param\": \"\", \"redirect\": \"\", \"dns_ipv6\": false, \"fast_open\": true, \"workers\": 1 } ulimit -n 51200 nano /root/s nano /root/start #!/bin/bash python /root/shadowsocks/server.py -c /root/shadowsocks/user-config.json -d restart nohup ss-server -p 222 -k 123321 -m chacha20 -t 600 1&gt; 1.txt 2&gt; 2.txt &amp; nohup ss-server -p 112 -k 123321 -m chacha20 -t 600 -u 1&gt; 3.txt 2&gt; 4.txt &amp; #/root/kcp/server_linux_amd64 -l \":444\" -t \"127.0.0.1:112\" -sndwnd 256 -rcvwnd 256 -mode fast &gt; kcptun.log 2&gt;&amp;1 &amp; #/root/kcp/server_linux_amd64 -l \":445\" -t \"127.0.0.1:222\" -sndwnd 256 -rcvwnd 256 -mode fast &gt; kcptun2.log 2&gt;&amp;1 &amp; chmod +x /root/schmod +x /root/start rebootwget -N –no-check-certificate https://raw.githubusercontent.com/91yun/serverspeeder/master/serverspeeder-all.sh &amp;&amp; bash serverspeeder-all.sh nano /etc/security/limits.conf * soft nofile 51200 * hard nofile 51200 nano /etc/sysctl.conf插入 # max open files fs.file-max = 51200 # max read buffer net.core.rmem_max = 67108864 # max write buffer net.core.wmem_max = 67108864 # default read buffer net.core.rmem_default = 65536 # default write buffer net.core.wmem_default = 65536 # max processor input queue net.core.netdev_max_backlog = 4096 # max backlog net.core.somaxconn = 4096 # resist SYN flood attacks net.ipv4.tcp_syncookies = 1 # reuse timewait sockets when safe net.ipv4.tcp_tw_reuse = 1 # turn off fast timewait sockets recycling net.ipv4.tcp_tw_recycle = 0 # short FIN timeout net.ipv4.tcp_fin_timeout = 30 # short keepalive time net.ipv4.tcp_keepalive_time = 1200 # outbound port range net.ipv4.ip_local_port_range = 10000 65000 # max SYN backlog net.ipv4.tcp_max_syn_backlog = 4096 # max timewait sockets held by system simultaneously net.ipv4.tcp_max_tw_buckets = 5000 # turn on TCP Fast Open on both client and server side net.ipv4.tcp_fastopen = 3 # TCP receive buffer net.ipv4.tcp_rmem = 4096 87380 67108864 # TCP write buffer net.ipv4.tcp_wmem = 4096 65536 67108864 # turn on path MTU discovery net.ipv4.tcp_mtu_probing = 1 # for high-latency network #net.ipv4.tcp_congestion_control = hybla # for low-latency network, use cubic instead net.ipv4.tcp_congestion_control = cubic echo&gt;/var/log/auth.loglastb cat /var/log/auth.log | grep Failed |awk ‘{print $11}’ |sort\\uniq -c |sort -nr |head -111netstat -an | grep “45.32.12.5:138” | awk ‘{print $5}’ |awk -F: ‘{print $1}’ |sort|uniq -c|sort -nr|head -1900 /etc/ssh/sshd_config服务器：ClientAliveInterval 60客户端：ServerAliveInterval 60 mkdir kcpcd kcpwget https://github.com/xtaci/kcptun/releases/download/v20160820/kcptun-linux-amd64-20160820.tar.gztar -zxf kcptun-linux-amd64-20160820.tar.gz nameserver 210.130.136.213 nameserver 210.130.136.212 #2 nameserver 61.114.95.19 #2 nameserver 210.225.175.66 #3 nameserver 218.223.32.1 #8 #nameserver 210.235.172.144 #37 nameserver 202.14.67.4 #51 nameserver 8.8.8.8 #51 nameserver 8.8.4.4 #51 iptables -I INPUT -s 117.136.2.158 -j DROP","categories":[],"tags":[{"name":"linux","slug":"linux","permalink":"lamzero.github.io/tags/linux/"},{"name":"vps","slug":"vps","permalink":"lamzero.github.io/tags/vps/"}],"keywords":[]}]}